// range - диапазон значений определенного типа (часто используется в условиях, циклах, коллекциях и пр.)


// Closed Range
let first10digits = 0...10 // от 0 до 10 включительно

// Half-Open Range
let first9digits = 0..<10 // не включает 10

// let range = 0>..10 // так нельзя и не имеет смысла

// One-Sided Range
let less10 = ...10 // все значения меньше 10 (часто применяется для получения элементов коллекции по индексу)

let bigger10 = 10... // все значения больше 10

type(of: first10digits)




